loliweive/stm32-oop/src/app/ds18b20_freertos/main.c
/**
 * @file    main.c
 * @brief   FreeRTOS CLI + 温湿度传感器 (DS18B20 / DHT11 可切换)
 *
 * ── 传感器切换 ─────────────────────────────────────────────
 *   修改下面的 SENSOR_TYPE 宏即可切换传感器:
 *     SENSOR_DS18B20  → M2  DS18B20 (OneWire, -55~125°C, 0.0625°C)
 *     SENSOR_DHT11    → M10 DHT11   (自有协议, 0~50°C + 湿度)
 *   两个模块共用 PA1, 可插拔替换, 编译时选择。
 */

#include "stm32f103xb.h"
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"

#include "rcc.h"
#include "gpio.h"
#include "uart.h"
#include "cli.h"
#include "ota_client.h"
#include "ota_transport_shared.h"
#include <stdio.h>
#include <string.h>

/* ═══════════════════════════════════════════════════════════════
 *  传感器选型 — 改这一行即可切换!
 * ═══════════════════════════════════════════════════════════════ */
#define SENSOR_DS18B20  1
#define SENSOR_DHT11    2
#define SENSOR_TYPE     SENSOR_DS18B20   /* <── 改成 SENSOR_DHT11 来切换! */

/* ── 根据传感器类型包含对应驱动 ──────────────────────────── */
#if SENSOR_TYPE == SENSOR_DS18B20
  #include "onewire.h"
  #include "ds18b20.h"
  #define SENSOR_NAME  "DS18B20"
#elif SENSOR_TYPE == SENSOR_DHT11
  #include "dht11.h"
  #define SENSOR_NAME  "DHT11"
  #define OW_PORT   GPIOA    /* 复用相同的宏名 */
  #define OW_PIN    GPIO_PIN_1
#else
  #error "Unknown SENSOR_TYPE — use SENSOR_DS18B20 or SENSOR_DHT11"
#endif

/* ── 引脚 ────────────────────────────────────────────────── */
#if SENSOR_TYPE == SENSOR_DS18B20
  #define OW_PORT      GPIOA
  #define OW_PIN       GPIO_PIN_1
#endif
#define UART_TX_PORT GPIOA
#define UART_TX_PIN  GPIO_PIN_9
#define UART_RX_PORT GPIOA
#define UART_RX_PIN  GPIO_PIN_10

/* ── 传感器数据 ──────────────────────────────────────────── */
typedef struct {
    float    temp_c;
#if SENSOR_TYPE == SENSOR_DHT11
    uint8_t  humidity;       /* DHT11 湿度 (%RH) */
#endif
    uint32_t timestamp_ms;
    bool     valid;
} TempReading;

/* ── 全局对象 ────────────────────────────────────────────── */
static QueueHandle_t temp_queue;
#if SENSOR_TYPE == SENSOR_DS18B20
static OneWireBus    ow_bus;
static DS18B20       sensor;
#elif SENSOR_TYPE == SENSOR_DHT11
static DHT11         sensor;
#endif
static UartPort      uart;
static GpioPin       led;
static CLI           cli;
static bool          stream_mode = false;

/* ── UART 写回调 (给 CLI) ──────────────────────────────────────── */
static void uart_cli_write(const char *str, size_t len)
{
    uart_send_buf(&uart, (const uint8_t *)str, len);
}

/* ═══════════════════════════════════════════════════════════════
 *  CLI 命令实现
 * ═══════════════════════════════════════════════════════════════ */

static void cmd_help(CLI *c, int argc, char **argv)
{
    (void)argc; (void)argv;
    cli_show_help(c);
}

static void cmd_temp(CLI *c, int argc, char **argv)
{
    (void)argc; (void)argv;

    TempReading r;
    if (xQueueReceive(temp_queue, &r, 0) == pdTRUE) {
        if (r.valid) {
#if SENSOR_TYPE == SENSOR_DS18B20
            cli_printf(c, "Temperature: %+6.2f C  (t=%lus)\r\n",
                       (double)r.temp_c, (unsigned long)(r.timestamp_ms / 1000));
#elif SENSOR_TYPE == SENSOR_DHT11
            cli_printf(c, "Temperature: %2u C  Humidity: %2u %%RH  (t=%lus)\r\n",
                       (unsigned)r.temp_c, (unsigned)r.humidity,
                       (unsigned long)(r.timestamp_ms / 1000));
#endif
        } else {
            cli_printf(c, "Sensor error — check failed\r\n");
        }
    } else {
        cli_printf(c, "No reading yet. Sensor warming up...\r\n");
    }
}

static void cmd_temp_stream(CLI *c, int argc, char **argv)
{
    (void)c; (void)argc; (void)argv;
    stream_mode = true;
    cli_printf(c, "Continuous temperature output started.\r\n");
    cli_printf(c, "Type 'temp-stop' to stop.\r\n");
}

static void cmd_temp_stop(CLI *c, int argc, char **argv)
{
    (void)c; (void)argc; (void)argv;
    stream_mode = false;
    cli_printf(c, "Temperature stream stopped.\r\n");
}

static void cmd_led(CLI *c, int argc, char **argv)
{
    if (argc < 2) {
        cli_printf(c, "Usage: led on|off|toggle\r\n");
        return;
    }
    if (strcmp(argv[1], "on") == 0) {
        gpio_set(&led, 0); /* PC13 低电平点亮 */
        cli_printf(c, "LED ON\r\n");
    } else if (strcmp(argv[1], "off") == 0) {
        gpio_set(&led, 1);
        cli_printf(c, "LED OFF\r\n");
    } else if (strcmp(argv[1], "toggle") == 0) {
        gpio_toggle(&led);
        cli_printf(c, "LED toggled\r\n");
    } else {
        cli_printf(c, "Unknown: '%s'. Use on|off|toggle\r\n", argv[1]);
    }
}

static void cmd_info(CLI *c, int argc, char **argv)
{
    (void)argc; (void)argv;
    cli_printf(c, "\r\n");
    cli_printf(c, "  System:    STM32F103C8T6 (Blue Pill)\r\n");
    cli_printf(c, "  Core:      Cortex-M3 @ 72MHz\r\n");
    cli_printf(c, "  Flash:     64KB\r\n");
    cli_printf(c, "  SRAM:      20KB\r\n");
    cli_printf(c, "  RTOS:      FreeRTOS V11\r\n");
    cli_printf(c, "  Tick:      %lu Hz\r\n", (unsigned long)configTICK_RATE_HZ);
    cli_printf(c, "  Heap free: %lu bytes\r\n", (unsigned long)xPortGetFreeHeapSize());
    cli_printf(c, "  Sensors:   " SENSOR_NAME " (PA1)\r\n");
    cli_printf(c, "\r\n");
}

static void cmd_uptime(CLI *c, int argc, char **argv)
{
    (void)argc; (void)argv;
    uint32_t s = (uint32_t)(xTaskGetTickCount() / configTICK_RATE_HZ);
    cli_printf(c, "Uptime: %lus (%lu:%02lu:%02lu)\r\n",
               (unsigned long)s,
               (unsigned long)(s / 3600),
               (unsigned long)((s % 3600) / 60),
               (unsigned long)(s % 60));
}

/* ── OTA 状态 ──────────────────────────────────────────────────── */
static OtaTransport   ota_xport;
static SharedXportCtx ota_xport_ctx;
static OtaClient      ota_client;
static bool           ota_in_progress = false;

static void cmd_ota_start(CLI *c, int argc, char **argv)
{
    (void)argc; (void)argv;

    if (ota_in_progress) {
        cli_printf(c, "OTA already in progress\r\n");
        return;
    }

    cli_printf(c, "Starting OTA firmware update...\r\n");
    cli_printf(c, "CLI suspended — send firmware now.\r\n\r\n");

    ota_in_progress = true;

    /* 初始化 OTA (复用当前 UART) */
    ota_transport_shared_create(&ota_xport, &ota_xport_ctx);
    ota_xport_ctx.uart = &uart;
    ota_xport_init(&ota_xport);

    ota_client_init(&ota_client, &ota_xport);
    ota_client_start(&ota_client);

    /* 驱动 OTA 状态机 (CLI 在此时阻塞) */
    while (ota_client_poll(&ota_client)) {
        vTaskDelay(pdMS_TO_TICKS(10));  /* 让出 CPU */
    }

    if (ota_client_get_state(&ota_client) == OTA_STATE_COMPLETE) {
        cli_printf(c, "\r\nOTA complete! Booting new firmware...\r\n");
        ota_client_boot(&ota_client);
        /* 不应到达 — boot 导致软复位 */
    } else {
        cli_printf(c, "\r\nOTA failed (error=%d). CLI restored.\r\n",
                   ota_client.error_code);
    }

    ota_in_progress = false;
    cli_prompt(c);
}

static void cmd_ota_status(CLI *c, int argc, char **argv)
{
    (void)argc; (void)argv;

    if (!ota_in_progress) {
        cli_printf(c, "OTA: idle (use 'ota-start' to begin update)\r\n");
        return;
    }

    OtaClientState s = ota_client_get_state(&ota_client);
    const char *state_names[] = {
        "IDLE", "HANDSHAKE", "RECEIVING", "VERIFYING", "COMPLETE", "ERROR"
    };

    cli_printf(c, "OTA Status: %s\r\n", state_names[s]);
    if (s == OTA_STATE_RECEIVING) {
        uint8_t pct = ota_client_get_progress(&ota_client);
        cli_printf(c, "Progress: %u%%\r\n", (unsigned)pct);
    }
}

static void cmd_reset(CLI *c, int argc, char **argv)
{
    (void)c; (void)argc; (void)argv;
    cli_printf(c, "Resetting...\r\n");
    vTaskDelay(pdMS_TO_TICKS(100));

    /* SCB AIRCR 软复位 */
    #define AIRCR_ADDR         ((volatile uint32_t *)0xE000ED0CUL)
    #define AIRCR_VECTKEY      (0x05FAUL << 16)
    #define AIRCR_SYSRESETREQ  (1UL << 2)
    *AIRCR_ADDR = AIRCR_VECTKEY | AIRCR_SYSRESETREQ;
    while (1) {}
}

/* ── 命令表 (NULL 终止) ──────────────────────────────────────── */
static const CLICommand commands[] = {
    { "help",        cmd_help,        "Show this help" },
    { "temp",        cmd_temp,        "Read temperature once" },
    { "temp-stream", cmd_temp_stream, "Start continuous temp output" },
    { "temp-stop",   cmd_temp_stop,   "Stop continuous temp output" },
    { "led",         cmd_led,         "Control LED: on|off|toggle" },
    { "info",        cmd_info,        "Show system information" },
    { "uptime",      cmd_uptime,      "Show system uptime" },
    { "reset",       cmd_reset,       "Software reset MCU" },
    { "ota-start",   cmd_ota_start,   "Start OTA firmware update" },
    { "ota-status",  cmd_ota_status,  "Show OTA update status" },
    { NULL, NULL, NULL }
};

/* ═══════════════════════════════════════════════════════════════
 *  Sensor Task — 独立温度采样
 * ═══════════════════════════════════════════════════════════════ */
static void task_sensor(void *params)
{
    (void)params;
    TempReading r;
    memset(&r, 0, sizeof(r));

#if SENSOR_TYPE == SENSOR_DS18B20
    /* ── DS18B20 初始化 ─────────────────────────────────── */
    ow_init(&ow_bus, OW_PORT, OW_PIN);
    if (!ds18b20_init(&sensor, &ow_bus)) {
        r.valid = false;
        r.timestamp_ms = xTaskGetTickCount();
        xQueueSend(temp_queue, &r, 0);
        vTaskDelete(NULL);
    }

    while (1) {
        gpio_set(&led, 0);  /* LED 亮 — 采样中 */

        ds18b20_start_conversion(&sensor);
        ds18b20_wait_conversion(&sensor);  /* 750ms @ 12-bit */

        uint8_t sp[9];
        r.valid = ds18b20_read_scratchpad(&sensor, sp);
        r.temp_c = r.valid ? ds18b20_parse_temp(sp) : 0.0f;
        r.timestamp_ms = xTaskGetTickCount();

        xQueueOverwrite(temp_queue, &r);
        gpio_set(&led, 1);

        if (stream_mode && r.valid) {
            cli_printf(&cli, "[%6lus] %+6.2f C\r\n",
                       (unsigned long)(r.timestamp_ms / 1000), (double)r.temp_c);
        }
        vTaskDelay(pdMS_TO_TICKS(2000));
    }

#elif SENSOR_TYPE == SENSOR_DHT11
    /* ── DHT11 初始化 ────────────────────────────────────── */
    dht11_init(&sensor, OW_PORT, OW_PIN);
    vTaskDelay(pdMS_TO_TICKS(1000));  /* DHT11 上电后需等待 1s */

    while (1) {
        gpio_set(&led, 0);  /* LED 亮 — 采样中 */

        r.valid = dht11_read(&sensor);
        r.temp_c = (float)dht11_get_temp(&sensor);
        r.humidity = dht11_get_humidity(&sensor);
        r.timestamp_ms = xTaskGetTickCount();

        xQueueOverwrite(temp_queue, &r);
        gpio_set(&led, 1);

        if (stream_mode && r.valid) {
            cli_printf(&cli, "[%6lus] %2u C  %2u %%RH\r\n",
                       (unsigned long)(r.timestamp_ms / 1000),
                       (unsigned)r.temp_c, (unsigned)r.humidity);
        }
        vTaskDelay(pdMS_TO_TICKS(2000));  /* DHT11 最大 1Hz */
    }
#endif
}

/* ═══════════════════════════════════════════════════════════════
 *  CLI Task — 交互式命令行
 * ═══════════════════════════════════════════════════════════════ */
static void task_cli(void *params)
{
    (void)params;

    /* 初始化 UART */
    {
        GpioPin tx, rx;
        GpioPin_ctor(&tx, UART_TX_PORT, UART_TX_PIN);
        gpio_set_mode(&tx, GPIO_CNF_ALT_PP | GPIO_MODE_OUT_50MHZ);
        GpioPin_ctor(&rx, UART_RX_PORT, UART_RX_PIN);
        gpio_set_mode(&rx, GPIO_CNF_FLOAT | GPIO_MODE_IN);
        UartPort_ctor(&uart, USART1, 115200);
        uart_init(&uart);
    }

    /* 初始化 CLI */
    cli_init(&cli, commands, uart_cli_write, NULL);

    /* 欢迎信息 */
    cli_printf(&cli, "\r\n");
    cli_printf(&cli, "╔══════════════════════════════════════╗\r\n");
    cli_printf(&cli, "║  STM32-oop  Interactive Shell        ║\r\n");
    cli_printf(&cli, "║  FreeRTOS + DS18B20 + CLI            ║\r\n");
    cli_printf(&cli, "╚══════════════════════════════════════╝\r\n");
    cli_printf(&cli, "Type 'help' for available commands.\r\n\r\n");
    cli_prompt(&cli);

    while (1) {
        uint8_t byte;
        if (uart_recv(&uart, &byte)) {
            cli_feed(&cli, (char)byte);
        }
        vTaskDelay(pdMS_TO_TICKS(10));  /* 10ms 轮询 */
    }
}

/* ═══════════════════════════════════════════════════════════════
 *  main — 初始化, 创建任务, 启动调度器
 * ═══════════════════════════════════════════════════════════════ */
int main(void)
{
    rcc_set_sysclk(RCC_HSE, 9);
    rcc_enable_gpio('A');
    rcc_enable_gpio('C');
    rcc_enable_usart(1);

    /* 初始化 LED (PC13) */
    GpioPin_ctor(&led, GPIOC, GPIO_PIN_13);
    gpio_set_mode(&led, GPIO_MODE_OUT_PP);
    gpio_set(&led, 1);

    /* 创建温度数据队列 */
    temp_queue = xQueueCreate(1, sizeof(TempReading));
    configASSERT(temp_queue != NULL);

    /* 创建任务 */
    xTaskCreate(task_sensor,  "Sensor", 128, NULL, 2, NULL);
    xTaskCreate(task_cli,     "CLI",    512, NULL, 1, NULL);

    vTaskStartScheduler();
    while (1) {}
    return 0;
}
